tinyNozzle/2D/6_with3outlets_cyclic_flush(CURRENT)/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     sonicFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.0005;

deltaT 		1e-09;

writeControl 	adjustableRunTime;

writeInterval   0.0000025;

cycleWrite 	0;

writeFormat     ascii;

writePrecision  3;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep 	yes;

maxCo 		0.05;

maxDeltaT 	1;

runTimeModifiable true;

// ************************************************************************* //
